{
  "characters": [
    {
      "id": 1,
      "name": "Sung Jinwoo",
      "title": "The Shadow Monarch",
      "rank": 1,
      "source": "Anime & Manhwa",
      "abilities": [
        "Shadow Extraction",
        "Shadow Storage",
        "Ruler's Authority",
        "Immortality/Resurrection",
        "Enhanced Physical Abilities"
      ],
      "description": "Once humanity's weakest hunter, Sung Jinwoo became the strongest hunter after receiving powers from the System. As the vessel of the Shadow Monarch Ashborn, he can extract shadows from defeated enemies to create an army of shadow soldiers. His incredible speed allows him to stop opponents from tracking his movements, and his exceptional durability helps him withstand powerful attacks. By the end of the series, he kills every single one of the Monarchs by himself, making him easily the strongest character in the series."
    },
    {
      "id": 2,
      "name": "The Absolute Being",
      "title": "God",
      "rank": 2,
      "source": "Manhwa",
      "abilities": [
        "Creation",
        "Omnipotence",
        "Reality Manipulation"
      ],
      "description": "The creator of the universe in Solo Leveling, the Absolute Being created all the Monarchs and Rulers. His name says everything about him anyone would need to know. The Absolute was the highest god of Sung Jin-woo's world. Despite his immense power, he was eventually betrayed and killed by his own creations, the Rulers."
    },
    {
      "id": 3,
      "name": "Antares",
      "title": "The Monarch of Destruction",
      "rank": 3,
      "source": "Manhwa",
      "abilities": [
        "Dragon Summoning",
        "Immense Strength",
        "Destruction Magic"
      ],
      "description": "As the Monarchs begin to fall to the Rulers, Antares is the only one whose sheer power gives him the authority to continue the war. The Monarch of Destruction is easily the strongest of the Monarchs other than Jin-woo. Because the Absolute Being created the Monarchs to destroy the world, Antares technically embodies everything that the Absolute created the Monarchs to be. Only one of his dragons, Kamish, was able to nearly wipe out all of humanity on his own, and Antares has control of innumerable dragons of similar or even greater power."
    },
    {
      "id": 4,
      "name": "Ashborn",
      "title": "The Previous Shadow Monarch",
      "rank": 4,
      "source": "Manhwa",
      "abilities": [
        "Shadow Manipulation",
        "Shadow Army Creation",
        "Immense Strength"
      ],
      "description": "As the original Shadow Monarch, Ashborn is easily one of the most powerful beings in the entire Solo Leveling universe. He was initially the Brightest Fragment of Brilliant Light, making him the strongest of the Rulers, before he stood up to them in defense of the Absolute and became a Monarch. As the Shadow Monarch, Ashborn had a physical strength that wasn't possessed by any other being in history. His combating abilities were seen when he brutally killed Baran by crushing his skull like a piece of fruit with his bare hands."
    },
    {
      "id": 5,
      "name": "The Brightest Fragment of Brilliant Light",
      "title": "Leader of the Rulers",
      "rank": 5,
      "source": "Manhwa",
      "abilities": [
        "Light Magic",
        "Leadership",
        "Immense Power"
      ],
      "description": "Chairman of the South Korean Hunter Association, Go Gunhee, is the vessel for the current Brightest Fragment of Brilliant Light. It's hard to scale the Rulers due to how little of their combat abilities are shown. However, the feats that they do pull off can still give a pretty decent indication of where the very strongest of their ranks might at least stack up. The Rulers pulled off three great feats of combat prowess: they killed The Absolute Being, they killed Ashborn, and they dealt the final blow to the Monarch of Destruction during his fight with Jin-woo."
    },
    {
      "id": 6,
      "name": "The Rulers",
      "title": "The Fragments of Light / Emissaries to the Absolute",
      "rank": 6,
      "source": "Manhwa",
      "abilities": [
        "Light Magic",
        "Vessel Possession",
        "Collective Power"
      ],
      "description": "As the protectors of the Absolute, the Rulers were specifically made by the creator of the universe to defend the world with their supreme power. The individual combat abilities of the Rulers are never shown, because they tend to always fight as a group. However, the feats they achieve as a group are some of the greatest in the series. The Rulers not only overthrow the very creator of the universe, but they also deal the final blow to the strongest of the monarchs, Antares. They also defeated Ashborn using their combined strength, though that was before he awakened as the Shadow Monarch."
    },
    {
      "id": 7,
      "name": "Yogumunt",
      "title": "Monarch of Transfiguration, The King of Demonic Spectres",
      "rank": 7,
      "source": "Manhwa",
      "abilities": [
        "Monster Creation",
        "Portal Summoning",
        "Cunning Intelligence"
      ],
      "description": "While not much is shown of his individual powers in battle, Yogumunt is heavily implied to be one of the most powerful and intelligent of the Monarchs. In the light novel, Yogumunt was stated to have been the most difficult for Jin-woo to kill out of all the Monarchs, other than the Monarch of Destruction. While the exact details of the battle weren't covered, Yogumunt's superior cunning is likely what made him so difficult for Jin-woo to kill. Yogumunt's power allows him to create innumerable monsters which could even rival the Shadow Monarch's army, and summon portals to transport the armies of his fellow Monarchs at will."
    },
    {
      "id": 8,
      "name": "Legia",
      "title": "Monarch of the Beginning",
      "rank": 8,
      "source": "Manhwa",
      "abilities": [
        "Non-Physical Form",
        "Spiritual Power",
        "Deception"
      ],
      "description": "Legia is a powerful monarch who doesn't need a physical body to showcase his full potential. After the death of the Absolute Being, Legia was ceased by the Rulers, who, after several years, sent the potent being to the human world to kill Sung Jinwoo. The proof of Legia's strength is in the circumstances surrounding his death. When Jin-woo first met him, Legias had been captured and held prisoner by the Rulers in chains. He then tried to make a deal with Jin-woo, but seeing through Legia's lies, Jin-woo attempted to kill the Monarch while he was still chained down. Even in chains, the Monarch of the Beginning did not go down without a fight. Jin-woo stated that if Legia had been unchained from the start of their fight, he likely wouldn't have stood a chance against him."
    },
    {
      "id": 9,
      "name": "Hockwan",
      "title": "Frost Monarch",
      "rank": 9,
      "source": "Manhwa",
      "abilities": [
        "Ice Magic",
        "Speed",
        "Tactical Intelligence"
      ],
      "description": "He may not be the most powerful of the Monarchs Jin-woo has fought, but the Frost Monarch still proved a sufficient challenge. His speed was nearly unmatched, and his ice magic was enough to stop even the strongest of S Rank Hunters dead in their tracks. On his own, the Frost Monarch wouldn't have lasted long against Sung Jin-woo, but he was also smart enough to know his limits and seek the help of his fellow Monarchs in taking down the Shadow Monarch. The Frost Monarch also fairly easily destroyed a Vessel of the Rulers, and just one of his ice spells was enough to hold off a large group of Jin-woo's Shadow Soldiers."
    },
    {
      "id": 10,
      "name": "Bellion",
      "title": "Grand Marshal of the Shadow Army",
      "rank": 10,
      "source": "Manhwa",
      "abilities": [
        "Whip Sword Mastery",
        "Shadow Power",
        "Leadership"
      ],
      "description": "Bellion is Jinwoo's strongest Shadow, serving as the Grand Marshal of his shadow army. He was originally Ashborn's strongest shadow soldier before being passed down to Jinwoo. Bellion's power is so immense that he could defeat all of Jinwoo's other shadows combined, including Beru and Igris. His strength is comparable to National Level Hunters, making him one of the strongest entities in the Solo Leveling universe."
    },
    {
      "id": 11,
      "name": "Thomas Andre",
      "title": "America's Strongest S-Rank Hunter",
      "rank": 11,
      "source": "Anime & Manhwa",
      "abilities": [
        "Reinforcement Magic",
        "Immense Strength",
        "Durability"
      ],
      "description": "Thomas Andre belonged to a family surrounded by numerous enemies, so he became a rebel who wouldn't leave a chance to dominate those who opposed him. With the arrival of the magic beasts, Andre showcased his potential in the fight against Kamish, following which he gained the position of a National Level Hunter. His fighting abilities were also tested in the fight against Shadow Monarch's human vessel, Jinwoo, whom he sent flying across several buildings with just one punch. Despite his immense power, he was ultimately defeated by Jinwoo."
    },
    {
      "id": 12,
      "name": "Sung Il-Hwan",
      "title": "First S-Rank Hunter",
      "rank": 12,
      "source": "Manhwa",
      "abilities": [
        "Enhanced Physical Abilities",
        "Combat Experience",
        "Vessel of a Ruler"
      ],
      "description": "Sung Il-Hwan is none other than our protagonist's long-lost father. He was the first S-Rank hunter who sacrificed his personal life for the sake of humanity. A decade before the main storyline, Sung Il-Hwan was stuck in a dungeon, and years later, when the Rulers learned about the Shadow Monarchs' host, they chose Sung Il-Hwan to kill him. When he was attacked by the A-Rank hunters while he was looking for Jinwoo, Hwan stunned each one of them with his physical strength."
    },
    {
      "id": 13,
      "name": "Beru",
      "title": "Marshal Grade Shadow",
      "rank": 13,
      "source": "Anime & Manhwa",
      "abilities": [
        "Regeneration",
        "Immense Strength",
        "Healing Others"
      ],
      "description": "Beru made his first appearance as a humanoid shadow of the Ant King. However, after Jinwoo defeats him in combat and makes him join his shadow army, Beru starts fighting for good and not out of his thirst for human blood. Being a Marshal Grade shadow, Beru was an immensely powerful individual who could wipe out opponents with a single strike. Beru's most incredible abilities were showcased when he helped Jinwoo attack the beast that was guarding the Tokyo S-Rank Gate in the Japan Crisis Arc. He not only got inside the opponent's body but also weakened and killed it from its insides. Besides his fighting skills, Beru also possessed exceptional healing abilities, which was one reason why Jinwoo ordered him to restore Jinho's health when he was severely injured in combat with Hwang Dongsoo."
    },
    {
      "id": 14,
      "name": "Igris",
      "title": "Blood-Red Commander",
      "rank": 14,
      "source": "Anime & Manhwa",
      "abilities": [
        "Swordsmanship",
        "Loyalty",
        "Combat Expertise"
      ],
      "description": "Igris was Ashborn's Left-Hand Man and is now Jinwoo's second-strongest shadow after Bellion. He was the final boss of the first season and has been a loyal servant to Jinwoo ever since being defeated. Igris is an expert swordsman and one of the most powerful shadows in Jinwoo's army. His combat abilities and loyalty make him an invaluable asset to the Shadow Monarch."
    },
    {
      "id": 15,
      "name": "Baran",
      "title": "Monarch of White Flames",
      "rank": 15,
      "source": "Manhwa",
      "abilities": [
        "White Flame Magic",
        "Immense Strength",
        "Durability"
      ],
      "description": "Monarch of White Flames, aka Baran, was an overconfident and cruel individual who didn't think twice before challenging the Shadow Monarch despite knowing that the opponent was way stronger than him. Baran was considered one of the strongest Monarchs in Solo Leveling, and that's why Antares took his help alongside Rakan to take Ashborn out during their battle against the Rulers. Years later, when Jin-Woo reached the Demon Castle in search of the final boss, he was confronted by Baran. The Monarch's clone was so powerful that he would have killed Ashborn's human host if the demon girl Esil hadn't distracted him."
    },
    {
      "id": 16,
      "name": "Tarnak",
      "title": "Monarch of Iron Body",
      "rank": 16,
      "source": "Manhwa",
      "abilities": [
        "Iron Body",
        "Physical Strength",
        "Durability"
      ],
      "description": "Tarnak, also known as the Monarch of Iron Body, had a similar persona to Baran. His abilities should not be questioned as he was the one among the three Monarchs who murdered Christopher Reed, the America-based National Level Hunter. However, when he accompanies Antares to attack Jin-Woo, his ego doesn't let him see the trap set by Thomas Andre and Jinwoo. Enraged by his hatred for humans, he tried to attack Bellion, Beru, and Thomas Andre without Antares. That's when he was ambushed by the trio and defeated in the battle."
    },
    {
      "id": 17,
      "name": "Querehsha",
      "title": "Monarch of Plagues",
      "rank": 17,
      "source": "Manhwa",
      "abilities": [
        "Plague Magic",
        "Regeneration",
        "Physical Strength"
      ],
      "description": "Querehsha, aka Monarch of Plagues, killed the National Level American Hunter Christopher Reed alongside Tarnak and Rakan. She also agreed to kill Jinwoo when the Frost Monarch told his kind about the Shadow Monarch's vessel. Before being sliced off by Sung Jinwoo in the conflict, Querensha made the opponent bleed with a single punch. She also boasted an incredible regenerative ability that helped her revive within seconds of being slaughtered by the Shadow Monarch."
    },
    {
      "id": 18,
      "name": "Liu Zhigang",
      "title": "China's National Level Hunter",
      "rank": 18,
      "source": "Manhwa",
      "abilities": [
        "Enhanced Strength",
        "Vessel of a Ruler",
        "Combat Experience"
      ],
      "description": "Liu Zhigang is a strong hunter from China who is also a National Level Hunter. His powers allowed him to outclass Goto Ryuji without breaking a sweat. Zhigang's strength was seen when he crushed hundreds of ants in the Chinese Coast East Area. Zhigang was the host to one of the rulers, so obviously, we see him surpassing not only the robust hunters but also the monsters that became a huge threat to humankind. Zhigang was considered the strongest hunter who ever existed in Asia until he crossed paths with Sung Jinwoo."
    },
    {
      "id": 19,
      "name": "Goto Ryuji",
      "title": "Japan's Strongest Hunter",
      "rank": 19,
      "source": "Anime & Manhwa",
      "abilities": [
        "Enhanced Speed",
        "Combat Skills",
        "Leadership"
      ],
      "description": "Goto Ryuji was not only considered the strongest hunter in Japan, but he was also one of the foreign hunters who matched the level of the Nation Level Hunters in terms of combating skills. Although he portrayed a calm and humble persona on the outside, in reality, he was an overconfident and selfish hunter who would not care about the members of his guild unless his position was at stake. Apart from his other skill sets, what made him a potent fighter was his extraordinary speed, which helped him tackle the Ant King when the beast attacked Ryuji from behind. However, despite being an eligible hunter, he wasn't any match for our protagonist, Jinwoo."
    },
    {
      "id": 20,
      "name": "Sung Suho",
      "title": "Son of the Shadow Monarch",
      "rank": 20,
      "source": "Manhwa",
      "abilities": [
        "Flight",
        "Enhanced Strength",
        "Shadow Powers"
      ],
      "description": "Sung Suho was able to fly when he was only a toddler. Suho could defeat all of Jin-woo's strongest Shadow Soldiers while he was still only in high school. In the epilogue of Solo Leveling, Jin-woo's son Sung Suho is shown displaying the power he inherited from his father. As the son of both the Shadow Monarch and an S Rank Hunter, Suho was bound to be one of the strongest in the world from the very moment he was born. However, his powers started to become too noticeable, so Jin-woo sealed his son's powers until he was able to train him to learn how to control them better. In his training exercises, Suho was able to defeat a large portion of Jin-woo's army by himself, even defeating Bellion, Beru, and Igris."
    }
  ]
}
